{
  "posts": [
    {
      "id": "DarkSparks",
      "title": "Sparks in the Dark",
      "date": "April 10, 2025",
      "excerpt": "Our brains like a factory of never-ending ideas that fade just as fast as the spark ignites...",
      "content": "<p>I often find myself coming up with new creative ideas wherever I am, pulling inspiration from the world around me and developing my own little stories in my head. Some of which I think of as master pieces, others no so much. Some of these ideas inspire me to want to create new things.</p><p>For example theres been a number of times where I've come up with amazing stories with in depth worlds, systems, and characters. Due to my love of manga and comics I would often like to turn these worlds into a reality but I lack the art skills to do so. You may be thinking why don't I just write down the stories in a document and send it to publishers? And simply put that isn't the medium that sparks my own interest.</p> <h2>Within the Forge</h2> <p1>So I have all these ideas and I want to bring them to life, so what should I do? The most obvious answer is to learn the skills required to achieve just that. Weather its taking a course, learning from online, or simply just brute forcing it everything is possible. As long as you allow yourself to take the time and not rush things that take years to master.</p2> <h2>What am I doing?</h2> <p1>As I said in the beginning I do have stories and worlds that I would love to illustrate and tell a story through those image but that will have to wait. As I still find my way around the world and taking my first steps into higher education I plan to focus on my main career before venturing off onto these hobbies that id like to delve into. Who knows that hobbies might become my main thing in the future but until then I need to settle into a stable career before experimenting. Playing it safe, or at least thats my play style in this open ended labyrinth of a world.</p1> <blockquote>Everything begins with an idea - Earl Nightingale</blockquote> <i>Let me know if you guys enjoy reading these posts, I try to make them entertaining and simple but also somewhat beneficial.</i>",
      "tags": ["Advice", "Reflection"]
    },
    {
      "id": "DeathMotivation",
      "title": "The Death of my Motivation",
      "date": "March 09, 2025",
      "excerpt": "My interest in programming came just as fast as it left. Here's what I've done to stay motivated...",
      "content": "<p>When I first started programming in 2020 I was fascinated by all cool and amazing things I could do. Making a character move for the first time in Unity was exciting and every new thing provided me with a new dopamine hit each time. But then I reached a point where things began getting technical, hard, and frustrating and all that excitement had vanished.</p> <h2>Stuck in a Deadlock</h2> <p1>For the past 2-3 years I haven't been doing much of anything to be honest other then focusing on my studies, playing games, and going outside (yes I touch grass). I kept seeing people make many cool things online, things I could only ever dream of doing.</p1> <h2>Revival</h2> <p1>Seeing all these amazing projects gave me a burst of motivation but as all forms of motivation they don't last too long. So how did I keep developing and find the motivation to keep going? In many cases there is never truly a way to keep fueling it, you can keep looking at other people's work and try to get motivated that way but ultimately you need to discipline yourself and push through until you find yourself loving your work and willingly going back to work on it.</p2><blockquote>Motivation gets you going, but discipline keeps you growing. - John C. Maxwell</blockquote>",
      "tags": ["Advice"]
    }
  ]
}