{
    "posts": [
        {
            "id": "Game Devlog 00 - The Concept",
            "title": "Game Devlog 00 - The Concept",
            "date": "March 10, 2025",
            "excerpt": "The concept of my upcoming game and a overview of my vision for it...",
            "content": "<p>Here's the break down:</p>\n<p>- A Hack and slash Ultra Kill inspired game made in Godot Engine using GDscript</p>\n<p>- 2 Active weapons, right hand holds some sort of melee weapon and left hand holds some sort of magic item that gives you a magic ability. You discover new weapons and magic items throughout the game.</p>\n<p>- Passive items will be various items that you collect through out the game that provide various buffs. Similar to how risk of rain 2 displays the items on your character these various items will be embedded into your hands and you'll be able to see them in or on your hand. For example a cursed eye object could go right in the palm of your left hand embedded into the skin. When the passive of that item is active the eye could be open and when it isn't the eye closes to provide some visual feedback for the various passives that will go on your hands and arms.</p>\n <p>Refer to rough img sketch below. (I know my art isn't great)</p><img src='https://acxt642gke.ufs.sh/f/Zb7b7YjNj6MvGQfzsc8mjbgq8IvBPOdei1YVuytzl4pQA03H'></img><p>I'll update this page with more info and lore wise stuff once I come up with one but thats the general premise I have so far.</p>",
            "tags": ["Devlog", "Godot"]
        },
        {
            "id": "The Death of My Motivation",
            "title": "The Death of my Motivation",
            "date": "March 09, 2025",
            "excerpt": "My interest in programming came just as fast as it left. Here's what I've done to stay motivated...",
            "content": "<p>When I first started programming in 2020 I was fascinated by all cool and amazing things I could do. Making a character move for the first time in Unity was exciting and every new thing provided me with a new dopamine hit each time. But then I reached a point where things began getting technical, hard, and frustrating and all that excitement had vanished.</p> <h2>Stuck in a Deadlock</h2> <p1>For the past 2-3 years I haven't been doing much of anything to be honest other then focusing on my studies, playing games, and going outside (yes I touch grass). I kept seeing people make many cool things online, things I could only ever dream of doing.</p1> <h2>Revival</h2> <p1>Seeing all these amazing projects gave me a burst of motivation but as all forms of motivation they don't last too long. So how did I keep developing and find the motivation to keep going? In many cases there is never truly a way to keep fueling it, you can keep looking at other people's work and try to get motivated that way but ultimately you need to discipline yourself and push through until you find yourself loving your work and willingly going back to work on it.</p2><blockquote>Motivation gets you going, but discipline keeps you growing. - John C. Maxwell</blockquote>",
            "tags": ["Advice"]
        }

    ]
}